vanchinh94/WSAN_SENSOR-2/Retasking/RE_retasking/RE_PIC24F/Router.c
/* Microchip ZigBee2006 Residential Stack
 * Demo Router
 *
 *******************************************************************************
 * FileName:        Router.c
 * Date modified:   14/08/2013
 *
 * Microcontroller: PIC24FJ128GA306
 * Transceiver:     Microchip MRF24J40
 *
 * Editor:          MPLAB X IDE v1.50
 * Complier:        MCC30 v3.31
 *
 * Developer:       Nguyen Tien Dat
 * Class:           KSTN - DTVT - K54
 * Group:           WSAN
 * Organization:    Lab411 - Hanoi University of Technology
 *
 * Description:     Chuong trinh nay thuc hien setup mot thiet bi tro thanh mot
 *                  node mang dong vai tro la mot Zigbee Router. Chuong trinh
 *                  cung duoc thiet ke de tuong tac voi cac thiet bi khac trong
 *                  mang theo chuan Zigbee (Zigbee Router hoac Zigbee End Device).
 *                  Cac hoat dong do bao gom: cho phep gia nhap/khong gia nhap
 *                  mang, yeu cau ban tin tu mot thiet bi hoac mot nhom thiet bi
 *                  trong mang, gui ban tin toi mot thiet bi hoac mot nhom cac
 *                  thiet bi trong mang.
 *
 * Note:            Xem lich su ma nguon trong file Readme.txt
*******************************************************************************/
//******************************************************************************
// Header Files
//******************************************************************************
// Include the main ZigBee header file.
#include "zigbee.def"
#include "zAPL.h"
#include "zNVM.h"
#include "zPHY_MRF24J40.h"
#include "console.h"
#include "p24FJ128GA306.h"
#include "delay.h"


//******************************************************************************
// Configuration Bits
//******************************************************************************
#if defined(__PIC24F__)
    // Configure by dat_a3cbq91
    _CONFIG1(JTAGEN_OFF & GCP_OFF & GWRP_OFF & LPCFG_OFF & ICS_PGx1 & WINDIS_OFF & FWDTEN_WDT_SW &  FWPSA_PR128 & WDTPS_PS512);
    _CONFIG2(IESO_ON & FNOSC_FRC & FCKSM_CSECME & OSCIOFCN_OFF & IOL1WAY_OFF & POSCMD_HS);
    _CONFIG3(BOREN_ON);
    // End by dat_a3cbq91
#elif defined(__dsPIC33F__) || defined(__PIC24H__)
    // Explorer 16 board
    _FOSCSEL(FNOSC_PRI)			// primary osc
    _FOSC(OSCIOFNC_OFF & POSCMD_XT)	// XT Osc
    _FWDT(FWDTEN_OFF)			// Disable Watchdog timer
    // JTAG should be disabled as well
#elif defined(__dsPIC30F__)
    // dsPICDEM 1.1 board
    _FOSC(XT_PLL16)		// XT Osc + 16X PLL
    _FWDT(WDT_OFF)		// Disable Watchdog timer
    _FBORPOR(MCLR_EN & PBOR_OFF & PWRT_OFF)
#else
    #error Other compilers are not yet supported.
#endif

//******************************************************************************
// Constants                        //defined application service   @dat_a3cbq91
//******************************************************************************
//Define for useful constants
#define SET             1
#define SaveEnergyMode  1
#define ENABLE          1
#define CLEAR           0
#define ActiveMode      0
#define DISABLE         0

//Define registers of MCU to control Leds
#if defined(USE_LED)
    
        #define WSAN_LED_TRIS 		TRISFbits.TRISF3
        #define WSAN_LED 		LATFbits.LATF3
  
    #define BLINK_LED_JOIN              4000
    #define BLINK_LED_NOT_JOIN          300
#endif



//******************************************************************************
// Function Prototypes
//******************************************************************************
//functions that have been created and modified by dat_a3cbq91
void HardwareInit( void );
// ProcessNONZigBeeTasks(void);
void ProcessZigBeePrimitives(void);

//Node mang su dung ham SenOneByte de gui ban tin toi Router-EMB
void SendOneByte(WORD ClusterID, BYTE MSB, BYTE LSB, BYTE cmd);
void SendDaTa(WORD ClusterID, BYTE MSB, BYTE LSB, BYTE d1, BYTE d2, BYTE d3);
void SendRouteDrawRequest(BYTE MSB_dest_addr, BYTE LSB_dest_addr);

//******************************************************************************
// Application Variables
//******************************************************************************
NETWORK_DESCRIPTOR  *currentNetworkDescriptor;
NETWORK_DESCRIPTOR  *NetworkDescriptor;
ZIGBEE_PRIMITIVE    currentPrimitive;
BYTE                orphanTries;

BYTE    i;
volatile BYTE counter = CLEAR, EnableSendCmd = DISABLE;
BYTE Addr_MSB, Addr_LSB, Cmd,ServiceCmd, ContentCmd;
BYTE Cmd1, Cmd2, Cmd3;//3 bien cho retasking
BYTE AllowJoin = SET;
extern NWK_STATUS nwkStatus;
WORD TimerCount = 0;//bien dem so lan ngat Timer
WORD ADD;
DWORD timer = TIMER_UNIT;//every 5s, the timer32 bit interrupt again.
#if defined(USE_LED)
    WORD Led_Count = BLINK_LED_NOT_JOIN;
#endif
#ifdef USE_COMPUTER
    volatile BYTE Val[6] = {0,0,0,0,0,0};
#endif

BYTE pk[50][50] = {0};//mang luu tru stt goi tin cua tung node
BYTE rpk[50][10] = {0};
BYTE rIP[50][2] = {0};//mang luu tru IP cua tung node
//BYTE macpk = 0;
BYTE t = 0;

//end by dat_a3cbq91

//******************************************************************************
//******************************************************************************
//******************************************************************************
int main(void)
{
    /*******************************create by lab411****************************/
    OSCCON = 0x2001;//current osc HS, new osc FRC

    CLKDIV = 0x0000;//Fcy = Fosc/2

    /************Maping Pins************/
    //unlock registers
    asm volatile ("mov #OSCCONL, w1  \n"
        "mov #0x46, w2     \n"
        "mov #0x57, w3     \n"
        "mov.b w2, [w1]    \n"
        "mov.b w3, [w1]    \n"
        "bclr OSCCON, #6");

    // INT1 >>> RP21
    RPINR0bits.INT1R = 21;

    /*------SPI1------*/
    // SCK1 >> RP26
    RPINR20bits.SCK1R = 26;
    RPOR13bits.RP26R  = 8;
    // SDO1 >> RP19
    RPOR9bits.RP19R   = 7;
    // SDI1 >> RP27
    RPINR20bits.SDI1R = 27;

    /*------SPI2------*/
    // SCK2 >> RP3
    RPINR22bits.SCK2R = 3;
    RPOR1bits.RP3R    = 11;
    //SDO2 >> RP2
    RPOR1bits.RP2R    = 10;
    // SDI2 >> RP4
    RPINR22bits.SDI2R = 4;

    /*------UART1-----*/
    // RX1 >> RP22
    RPINR18bits.U1RXR = 22;
    // TX1 >> RP25
    RPOR12bits.RP25R  = 3;

    /*------UART2-----*/
    // RX2 >> RP24
    RPINR19bits.U2RXR = 24;
    // TX2 >> RP23
    RPOR11bits.RP23R  = 5;

    //lock register
    asm volatile ("mov #OSCCONL, w1  \n"
        "mov #0x46, w2     \n"
        "mov #0x57, w3     \n"
        "mov.b w2, [w1]    \n"
        "mov.b w3, [w1]    \n"
        "bset OSCCON, #6");
    /*********************************end by lab411*****************************/
    CLRWDT();
    ENABLE_WDT();

    NetworkDescriptor = NULL;
    orphanTries = 3;
    // If you are going to send data to a terminal, initialize the UART.
    ConsoleInit();

    // Initialize the hardware - must be done before initializing ZigBee.
    HardwareInit();
    //printf("Init Hardware\r\n");

    // Initialize the ZigBee Stack.
    ZigBeeInit();
    //printf("Init Zigbee\r\n");

    // *************************************************************************
    // Perform any other initialization here
    // *************************************************************************
    printf("R&D ZigBee-Router EMB by WSAN-Lab411\r\n");
    #if (RF_CHIP == MRF24J40)
        printf("Transceiver-MRF24J40\r\n");
    #else
        printf("Transceiver-Unknown\r\n" );
    #endif

    // Enable interrupts to get everything going.
    RFIE = ENABLE;

    /* Start the network anew each time Node is booted up */
    NWKClearNeighborTable();
    #if defined(I_SUPPORT_BINDING)
        ClearBindingTable();
    #endif

