vanchinh94/WSAN_SENSOR-2/Retasking/RE_retasking/RE_PIC24F/Router.c
                    currentNetworkDescriptor = currentNetworkDescriptor->next;
                    //if have other networks
                    if (currentNetworkDescriptor)
                    {
                        printf(". Trying next discovered network: " );
                        PrintWord(currentNetworkDescriptor->PanID.Val);
                        printf("\r\n");
                        goto SubmitJoinRequest;
                    }
                    //neu chi tim thay mot mang duy nhat
                    else
                    {
                        //Ran out of descriptors.  Free the network descriptor list, and fall
                        // through to try discovery again.
                        printf(". Cleaning up and retrying discovery!\r\n" );
                        while (NetworkDescriptor)
                        {
                            currentNetworkDescriptor = NetworkDescriptor->next;
                            nfree( NetworkDescriptor );
                            NetworkDescriptor = currentNetworkDescriptor;
                        }
                    }
                }
            }
            break;

        case NLME_START_ROUTER_confirm:
            if (!params.NLME_START_ROUTER_confirm.Status)
            {
                printf("Router Started! Enabling joins...\r\n" );
                params.NLME_PERMIT_JOINING_request.PermitDuration = 0xFF;   // No Timeout
                params.NLME_PERMIT_JOINING_request._updatePayload = TRUE;
                currentPrimitive = NLME_PERMIT_JOINING_request;
            }
            else
            {
                printf("Router start Failed:" );
                PrintChar( params.NLME_JOIN_confirm.Status );
                printf(". We cannot route frames\r\n" );
                currentPrimitive = NLME_START_ROUTER_request;//request again
            }
            break;

        case NLME_PERMIT_JOINING_confirm:
            if (!params.NLME_PERMIT_JOINING_confirm.Status)
            {
                printf("Current Network Address is: ");
                PrintWord(macPIB.macShortAddress.Val);
                printf("\r\n");
                if(macPIB.macShortAddress.Val != 0x0001)
                {
                    // Thiet lap lai dia chi mang cua Router_EMB @dat_a3cbq91
                    macPIB.macShortAddress.v[1] = NetworkAddrMSB_EMB;
                    macPIB.macShortAddress.v[0] = NetworkAddrLSB_EMB;
                    // Set ShortAddr on Transceiver !
                    PHYSetShortRAMAddr(0x03, macPIB.macShortAddress.v[0]);
                    PHYSetShortRAMAddr(0x04, macPIB.macShortAddress.v[1]);
                    printf("Network Address has just re-assigned is 0x0001\r\n");
                }
                currentPrimitive = NO_PRIMITIVE;
            }
            else
            {
                printf("Join permission Failed: " );
                PrintChar( params.NLME_PERMIT_JOINING_confirm.Status );
                printf(". We cannot allow joins\r\n" );
                currentPrimitive = NLME_PERMIT_JOINING_request;//request again
            }
            break;

        case NLME_JOIN_indication:
            printf( "Node " );
            PrintWord(params.NLME_JOIN_indication.ShortAddress.Val);
            printf( " With MAC Address " );
            //@dat_a3cbq91: Print MAC address of node has just joined
            for(i = 7; i ^ 0xFF; --i)
            {
                PrintChar(params.NLME_JOIN_indication.ExtendedAddress.v[i]);
            }
            printf( " just joined.\r\n" );
            /* For Zigbee 2006: If a new device with the same old longAddress address
            * joins the PAN, then make sure the old short address is no longer used and is
            * overwritten with the new shortAddress & longAddress combination
            */
            /* Neu mot thiet bi da tung la thanh vien cua mang, can phai dam bao
             * la dia chi mang khong duoc dung nua va cap (dia chi mang & dia chi MAC)
             * se duoc ghi lai trong bang @dat_a3cbq91
             */
            {  /* same long address check block */
                APS_ADDRESS_MAP currentAPSAddress1;
                currentAPSAddress1.shortAddr   =   params.NLME_JOIN_indication.ShortAddress;
                currentAPSAddress1.longAddr    =   params.NLME_JOIN_indication.ExtendedAddress;

                if(LookupAPSAddress(&params.NLME_JOIN_indication.ExtendedAddress) )
                {

                    for( i = 0; i ^ apscMaxAddrMapEntries; i++)
                    {
                        #ifdef USE_EXTERNAL_NVM
                            GetAPSAddress( &currentAPSAddress,  apsAddressMap + i * sizeof(APS_ADDRESS_MAP) );
                        #else
                            GetAPSAddress( &currentAPSAddress,  &apsAddressMap[i] );
                        #endif
                        if (!memcmp( (void *)&currentAPSAddress.longAddr, (void *)&currentAPSAddress1.longAddr, 8 ))
                        {
                            /* overwrite the old with the new short/long address combo  */
                            #ifdef USE_EXTERNAL_NVM
                                PutAPSAddress( apsAddressMap + i * sizeof(APS_ADDRESS_MAP), &currentAPSAddress1);
                            #else
                                PutAPSAddress( &apsAddressMap[i], &currentAPSAddress1 );
                            #endif
                        }
                    }   /* end for loop */
                }       /* end if */
            }           /* end address check block */
            #ifdef I_SUPPORT_SECURITY
                #ifdef I_AM_TRUST_CENTER
                {
                    BOOL AllowJoin = TRUE;
                    // decide if you allow this device to join
                    if( !AllowJoin )
                    {
                        // no need to set deviceAddress, since it is overlap with NLME_JOIN_indication
                        //params.NLME_LEAVE_request.DeviceAddress = params.NLME_JOIN_indication.ExtendedAddress;
                        params.NLME_LEAVE_request.RemoveChildren = TRUE;
                        currentPrimitive = NLME_LEAVE_request;
                        break;
                    }

                    #ifdef I_SUPPORT_SECURITY_SPEC
                        if( params.NLME_JOIN_indication.secureJoin )
                        {
                            BYTE i;
                            for(i = 0; i < 16; i++)
                            {
                                    KeyVal.v[i] = 0;
                            }
                            params.APSME_TRANSPORT_KEY_request.Key = &KeyVal;
                            params.APSME_TRANSPORT_KEY_request.TransportKeyData.NetworkKey.KeySeqNumber = 0;

