vanchinh94/WSAN_SENSOR-2/Retasking/RE_retasking/RE_PIC24F/Router.c
        case NLME_RESET_confirm:
            printf("ZigBee Stack has been reset\r\n" );
            /* For Zigbee 2006 The Specs require that node needs to
             * try joining as an orphan first after each reset,
             * see Mandatory test 3.9
            */
            ZigBeeStatus.flags.bits.bTryOrphanJoin = SET;

            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_LEAVE_confirm:
            PrintChar(params.NLME_LEAVE_confirm.Status);
            printf(" Leaving the Zigbee network\r\n" );

            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSDE_DATA_indication:
            {
                currentPrimitive = NO_PRIMITIVE;
                switch (params.APSDE_DATA_indication.DstEndpoint)
                {
                    // ************************************************************************
                    // Place a case for each user defined endpoint.
                    // ************************************************************************
                    case WSAN_Dst:
                    {
                        switch(params.APSDE_DATA_indication.ClusterId.Val)
                        {
                            case SLEEP_CONFIRM_CLUSTER:
                                printf("#VL:");
                                PrintChar(APLGet());
                                printf("\r\n");
                                break;

                            case WAKE_CONFIRM_CLUSTER:
                                printf("#WC:");
                                PrintChar(APLGet());
                                printf("\r\n");
                                break;

                            case STATE_NODE_CLUSTER:
                                printf("#SN:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                PrintChar(APLGet());//MM
                                PrintChar(APLGet());//SS
                                printf("\r\n");
                                break;

                            case JOIN_CONFIRM_CLUSTER:
                                printf("#JN:");
                                ADD=params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val;
                                PrintWord(ADD);
                                //printf("---");
                                PrintChar(APLGet()); //MM
                                APLGet();//Rejected byte
                                printf("\r\n");
                                #if defined(USE_LED)
                                    WSAN_LED = ~WSAN_LED;
                                #endif
                                break;

                            case HTE_RESPONSE_CLUSTER:
                                {
                                    printf("#RD:");
                                    PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                    PrintChar(APLGet());//Byte0 dia chi MAC
                                    PrintChar(APLGet());//nhiet do
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//do am
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//dien ap
                                    PrintChar(APLGet());
                                    
                                    printf("\r\n");
                                    #if defined(USE_LED)
                                        WSAN_LED = ~WSAN_LED;
                                    #endif
                                }
                                break;

                            case HTE_AUTO_SEND_CLUSTER:
                                {
                                    printf("#AD:");
                                    PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                    PrintChar(APLGet());//Byte0 dia chi MAC
                                    PrintChar(APLGet());//nhiet do
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//do am
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//dien ap
                                    PrintChar(APLGet());
                                    printf("\r\n");
                                    }
                                break;
                                /******************Camera command********************/
                                case CMR_RESPONSE_CLUSTER://VAN_CHINH_57
                                {
                                    WORD IP;//dia chi IP
                                    BYTE mac;//dia chi mac
                                    BYTE packet;// stt goi tin
                                    BYTE HIP, LIP;// luu tru 2 byte cua IP
                                    BYTE test,test_1;// bien luu gia tri hien tai va truoc do cua du lieu
                                    BYTE kt = 0;//bien ket thuc data anh( kt=1: khi ket thuc data anh)
                                    printf("#RC:");// khai bao moi
                                    IP = params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val;
                                    PrintWord(IP);//in ra IP
                                    HIP = (BYTE)(IP >> 8);//
                                    LIP = (BYTE)(IP & 0x00ff);
                                    mac = APLGet();
                                    PrintChar(mac);//in ra Byte0 dia chi MAC
                                    PrintChar(APLGet());//2 byte do dai anh
                                    PrintChar(APLGet());
                                    packet = APLGet();
                                    PrintChar(packet);//in ra stt goi
                                    pk[mac][0]++;// tang so packet cua node "mac" len 1(gia tri nay dc luu o vi tri 0)
                                    pk[mac][packet + 1] = packet + 1;// luu stt goi tin vao vi tri(tinh tu vi tri 1)
                                    for(i=0;i<80;i++)//in data goi tin
                                    {  //nhan data anh
                                        test=APLGet();
                                        PrintChar(test);
                                        if(test_1==0xFF && test==0xD9)//kiem tra dieu kien ket thuc data anh
                                        {
                                            kt = 1;//set len 1 khi ket thuc data anh
                                            break;
                                        }
                                        test_1=test;
                                    };
                                    printf("\r\n");

                                    if(kt == 1)// kiem tra bien ket thuc data anh
                                    {
                                        if(pk[mac][0] > (packet/2))//kiem tra so goi nhan dc:
                                        {                          //neu > 1/2 tong so goi cua anh thi kiem goi loi
                                            //macpk = mac;
                                            rIP[mac][0] = HIP;
                                            rIP[mac][1] = LIP;
                                            BYTE j = 0;
                                            for(i = 1; i <= (packet +1); i++)//kiem tra goi loi
                                            {
                                                if(pk[mac][i] == 0)//neu khong nhan dc goi thu i thi gia tri mang tai vitri i = 0
                                                {
                                                    printf("\nPacket error:");
                                                    rpk[mac][j] = i - 1;//luu stt goi loi vao mang rpk bat dau tu vi tri 0
                                                    PrintChar(rpk[mac][j]);
                                                    printf("\n");
                                                    j++;
                                                }
                                            }
                                            SendOneByte(PACKET_REQUEST_CLUSTER, HIP, LIP, rpk[mac][0]);//gui request goi loi dau tien
                                        }
                                        else
                                            SendOneByte(CMR_REQUEST_CLUSTER, HIP, LIP, 0x40);
                                    }

