vanchinh94/WSAN_SENSOR-2/Retasking/RE_retasking/RE_PIC24F/Router.c
                                    #if defined(USE_LED)
                                       WSAN_LED = ~WSAN_LED;
                                    #endif
                               
                                }
                                break;

                            case PACKET_RESPONSE_CLUSTER://VAN_CHINH_57
                            {
                                t++;//tang bien dem tro toi vi tri luu goi loi tiep theo
                                BYTE mac, packet;
                                printf("#RC:");// nhan biet ban tin du lieu anh
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);//in ra IP
                                mac = APLGet();
                                PrintChar(mac);//in ra Byte0 dia chi MAC
                                PrintChar(APLGet());//2 byte do dai anh
                                PrintChar(APLGet());
                                packet = APLGet();
                                PrintChar(packet);//in ra stt goi loi
                                pk[mac][packet + 1] = packet + 1;// luu lai stt goi nhan dc
                                for( i= 0; i< 80; i++)//in ra data goi nhan dc
                                    PrintChar(APLGet());
//                                if(rpk[macpk][t])//kiem tra xem con goi loi k; neu con thi gui tin yeu cau gui lai goi do
//                                    SendOneByte(PACKET_REQUEST_CLUSTER, rIP[macpk][0], rIP[macpk][1], rpk[macpk][t]);
                                if(rpk[mac][t])//kiem tra xem con goi loi k; neu con thi gui tin yeu cau gui lai goi do
                                    SendOneByte(PACKET_REQUEST_CLUSTER, rIP[mac][0], rIP[mac][1], rpk[mac][t]);
                                else//neu k con goi loi
                                {
                                    pk[mac][0] = 0;//dua tong so goi ve 0
                                    t = 0;// dua bien dem goi loi ve 0
                                }
                                printf("\r\n");
                            }break;

                            /* Place other Cluster.ID cases here */
                            case ACTOR_RESPONSE_CLUSTER:
                            {
                                printf("#OK:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);//Dia chi mang node gui
                                PrintChar(APLGet());//Byte0 dia chi MAC ndoe gui
                                PrintChar(APLGet());//Ma xac nhan cua Actor
                                printf("\r\n");
                                #if defined(USE_LED)
                                   WSAN_LED = ~WSAN_LED;
                                #endif
                            }
                            break;

                            case ROUTE_DRAW_REPLY_CLUSTER:
                            {
                                BYTE i;
                                BYTE NodeNumber;
                                BYTE *pListNode;
                                printf("#TR:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);//Dia chi mang node gui
                                NodeNumber = APLGet();//Lay ro so node mang goi tin di qua
                                PrintChar(NodeNumber);
                                for (i = 0; i<NodeNumber;i++) PrintChar(APLGet());
                                printf("\r\n");
                            }
                            break;
                            
                            case STATUS_RESPONSE:
                            {
                                printf ("#SC:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                PrintChar(APLGet());//Byte0 dia chi MAC
                                PrintChar(APLGet());//SHT_STATUS
                                PrintChar(APLGet());//PTC06_STATUS
                                PrintChar(APLGet());//CYCLE_SENDING_STATUS
                                printf ("\r\n");
                            }
                            break;

                            case NONE_SUPPORT:
                            {
                                printf ("#SC:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                PrintChar(APLGet());//Byte0 dia chi MAC
                                printf ("None support!\r\n");
                            }

                            default:
                                break;
                        }   /* switch end*/
                        if( currentPrimitive != APSDE_DATA_request )
                            TxData = TX_DATA_START;
                    }           /* if msg */
                    break;

                    default:
                        break;
                }
                APLDiscardRx();
            }
            break;

        case APSDE_DATA_confirm:
            if (params.APSDE_DATA_confirm.Status)
            {
                PrintChar(params.APSDE_DATA_confirm.Status);
                printf(" Error sending message\r\n");
            }
            else
            {
                printf("Sending message OK!\r\n" );
            }
            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSME_ADD_GROUP_confirm:
        case APSME_REMOVE_GROUP_confirm:
        case APSME_REMOVE_ALL_GROUPS_confirm:
            printf("Perform Group Operation\r\n" );
            currentPrimitive = NO_PRIMITIVE;
            break;

        case NO_PRIMITIVE:
            //if the router has not joined any network, do the following
            if (AllowJoin &&!ZigBeeStatus.flags.bits.bNetworkJoined)
            {
                //if the router has not tried to join any network
                if (!ZigBeeStatus.flags.bits.bTryingToJoinNetwork)
                {
                    //if the router want to join as an orphan
                    if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                    {
                        printf("Trying to join network as an orphan...\r\n" );

                        params.NLME_JOIN_request.ScanDuration     = 8;
                        params.NLME_JOIN_request.ScanChannels.Val = ALLOWED_CHANNELS;
                        params.NLME_JOIN_request.JoinAsRouter     = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork    = 0x01;
                        params.NLME_JOIN_request.PowerSource      = MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle     = TRUE;
                        params.NLME_JOIN_request.MACSecurity      = FALSE;

                        params.NLME_JOIN_request.ExtendedPANID = currentNetworkDescriptor->ExtendedPANID;
                        currentPrimitive = NLME_JOIN_request;
                    }
                    else
                    {
                        printf("Trying to join network as a new device!\r\n" );
                        params.NLME_NETWORK_DISCOVERY_request.ScanDuration          = 8;
                        params.NLME_NETWORK_DISCOVERY_request.ScanChannels.Val      = ALLOWED_CHANNELS;
                        currentPrimitive = NLME_NETWORK_DISCOVERY_request;
                    }
                }
            }
            else
            {
                #ifdef USE_COMPUTER
                if (ZigBeeReady() & (!ZigBeeStatus.flags.bits.bHasBackgroundTasks))
                {
                    if(EnableSendCmd)
                    {
                        Addr_MSB = GetHexByte(Val[0],Val[1]);
                        Addr_LSB = GetHexByte(Val[2],Val[3]);
                        Cmd = GetHexByte(Val[4],Val[5]);

