vanchinh94/WSAN_SENSOR-2/Retasking/RE_retasking/RE_PIC24F/Router.c
                        printf("Command: ");
                        PrintChar(Addr_MSB);
                        PrintChar(Addr_LSB);
                        PrintChar(Cmd);
                        printf("\r\n");

                        //Neu Buffer[2] = 0x00 -> yeu cau du lieu nhiet do - do am
                        //Neu Buffer[2] != 0x00 -> yeu cau bat van
                                                //for send broadcast messages
                        if ((Addr_MSB == 0xff)&&(Addr_LSB == 0xff))
                        {
                            ContentCmd = Cmd & 0x1F;//take content of cmd
                            ServiceCmd = Cmd >> 5;//take kind of cmd

                            switch (ServiceCmd)
                            {
                                case 1:
                                    SendOneByte(SLEEP_SYN_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    #ifdef USE_USART
                                        printf("Sleep request OK\r\n");
                                    #endif
                                    break;

                                case 2:
                                    #ifdef USE_EXTERNAL_NVM
                                        pCurrentRoutingEntry = routingTable;   //+ (WORD)neighborIndex * (WORD)sizeof(NEIGHBOR_RECORD);
                                    #else
                                        pCurrentRoutingEntry = &(routingTable[0]);
                                    #endif
                                    printf("#RT:");
                                    PrintChar(macPIB.macShortAddress.v[1]);
                                    PrintChar(macPIB.macShortAddress.v[0]);
                                    for ( i=0; i < ROUTING_TABLE_SIZE-RESERVED_ROUTING_TABLE_ENTRIES; i++ )
                                    {
                                        GetRoutingEntry(&currentRoutingEntry,pCurrentRoutingEntry);
                                        if ((currentRoutingEntry.destAddress.byte.MSB !=0xff))
                                        {
                                            PrintChar(currentRoutingEntry.destAddress.byte.MSB);
                                            PrintChar(currentRoutingEntry.destAddress.byte.LSB);
                                            PrintChar(currentRoutingEntry.nextHop.byte.MSB);
                                            PrintChar(currentRoutingEntry.nextHop.byte.LSB);
                                        }
                                        #ifdef USE_EXTERNAL_NVM
                                            pCurrentRoutingEntry += (WORD)sizeof(ROUTING_ENTRY);
                                        #else
                                            pCurrentRoutingEntry++;
                                        #endif
                                    }
                                    printf("\r\n");
                                    SendOneByte(ROUTING_TABLE_READ_CLUSTER, Addr_MSB, Addr_LSB, Cmd);
                                    EnableSendCmd = CLEAR;
                                    #ifdef USE_USART
                                        printf("Read Routing Table request OK");
                                    #endif
                                    break;

                                case 0x:
                                    SendOneByte(RE_CONFIG_CYCLE_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    break;

                                case 5:
                                    SendOneByte(RE_ASSIGN_LEVEL_MQ6_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    break;

                                default:
                                    break;
                            }
                        }
                        else
                        {
                            //for send unicast message
                            switch (Cmd)
							{
							case 0x00://Lay nhiet do - do am sensor
								SendOneByte(HTE_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);
							break;
							case 0xF1://Yeu cau ve tuyen
							SendRouteDrawRequest(Addr_MSB, Addr_LSB);
							break;
                            default://Gui lenh cho Actor
                            SendOneByte(ACTOR_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);
							break;
                            EnableSendCmd = CLEAR;
							}
                        }
                    }
                }//end computer
                #else
                if (ZigBeeReady() && (!ZigBeeStatus.flags.bits.bHasBackgroundTasks))
                {
                    if(EnableSendCmd)
                    {
                        //for send broadcast messages
                        if ((Addr_MSB == 0xff)&&(Addr_LSB == 0xff))
                        {
                            ContentCmd = Cmd & 0x0F;//take content of cmd
                            ServiceCmd = Cmd & 0xF0;//take kind of cmd

                            switch (ServiceCmd)
                            {
                                //che do tiet kiem nang luong: tat - ngu luan phien
                                case 0x00:
                                    //Neu ContentCmd = 0x01 thi chuyen tu che do active --> tiet kiem nang luong.
                                    //Neu ContentCmd = 0x02 thi chuyen tu che do tiet kiem nang luong --> active.
                                    SendOneByte(SLEEP_SYN_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    printf("Broadcast messeage!!!\n");
                                    EnableSendCmd = CLEAR;
                                    break;

                                //thay doi chu ki gui du lieu nhiet do do am trong che do active.
                                case 0x10:
                                    SendOneByte(RE_CONFIG_CYCLE_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;

                                //thay doi nguong so sanh cam bien MQ6_V1
                                case 0x20:
                                    SendOneByte(RE_ASSIGN_LEVEL_MQ6_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;

