vanchinh94/WSAN_SENSOR-2/Retasking/RE_retasking/RE_PIC24F/Router.c
                                case 0x30:
                                    SendOneByte(WAKE_SYN_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;

                                default:
                                    break;
                           }
                        }
                        else
                        {
                            switch(Cmd)
                            {
                                case 0x00:
                                    SendOneByte(HTE_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);//Lay nhiet do - do am sensor
                                    break;
                                case 0x40:// khai bao moi
                                    SendOneByte(CMR_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);//Lay anh sensor                                   
                                    break;
                                case 0x41://khai bao lenh lay thong tin node mang
                                    SendOneByte(STATUS_REQUEST, Addr_MSB,Addr_LSB,Cmd);//thong bao trang thai node mang
                                    break;
                                case 0x50:// lenh bo che do lay nhiet do do am
                                    SendOneByte(RETASK_SHT10, Addr_MSB, Addr_LSB, Cmd);
                                    break;
                                case 0x51://lenh set che do lay nhiet do do am
                                    SendOneByte(RETASK_SHT10, Addr_MSB, Addr_LSB, Cmd);
                                    break;
                                case 0x60://lenh bo che do chup anh
                                    SendOneByte(RETASK_PTC06, Addr_MSB, Addr_LSB, Cmd);
                                    break;
                                case 0x61://lenh set che do chup anh
                                    SendOneByte(RETASK_PTC06, Addr_MSB, Addr_LSB, Cmd);
                                    break;
                                case 0x70://lenh bo che do gui data dinh ki
                                    SendOneByte(RETASK_CYCLE_SENDING, Addr_MSB, Addr_LSB, Cmd);
                                    break;
                                case 0x71://lenh set che do gui data dinh ki
                                    SendOneByte(RETASK_CYCLE_SENDING, Addr_MSB, Addr_LSB, Cmd);
                                    break;
                                case 0x80:
                                    SendDaTa(RETASK_ALL_FUNCTION,Addr_MSB, Addr_LSB, Cmd1, Cmd2, Cmd3);
                                    break;
                                case 0xF1:
                                    SendRouteDrawRequest(Addr_MSB, Addr_LSB);	//Yeu cau ve tuyen
                                    break;

                                default:
                                    SendOneByte(ACTOR_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);//Gui lenh cho Actor
                                    break;
                            }
                            EnableSendCmd = CLEAR;
                        }
                    }
                }
                #endif
            }
            break;

        default:
            PrintChar( currentPrimitive );
            printf(" Unhandled primitive\r\n" );
            currentPrimitive = NO_PRIMITIVE;
            break;
    }
}

void HardwareInit(void)
{
    /*Configure digital pins @ added by dat_a3cbq91*/
    ANSE = 0x0000;
    ANSG = 0x0000;
    ANSD = 0x0000;

    /*Configure for SPI communication*/
    #if(CLOCK_FREQ < 1000000)
        //SPI1 for RF transceiver
        SPI1CON1 = 0b0000000100111111;      // CLOCK_FREQ as SPI CLOCK
        SPI1STAT = 0x8000;

        //SPI2 for EEPROM
        SPI2CON1 = 0b0000000100111111;      // CLOCK_FREQ as SPI CLOCK
        SPI2STAT = 0x8000;
    #else
        //comment by dat_a3cbq91
        /* SPI1 for RF transceiver */
        SPI1CON1 = 0b0000000100111110;  //PIC24FJ128GA306 is Master, MRF24J40 is Slaver
                                        //Internal SPI clock is enabled
                                        //SDO1 pin is controlled by the module
                                        //Communication is byte-wide (8 bits)
                                        //Input data is sampled at the middle of data output time
                                        //Serial output data changes on transition from active clock state to Idle clock state
                                        //~SS1 pin is not used by the module; pin is controlled by the port function
                                        //Idle state for the clock is a low level; active state is a high level
                                        //Secondary prescale 1:1
                                        //Primary prescale 4:1 -> CLOCK_FREQ/2/4 as SPI CLOCK

        //Enables module and configures SCKx, SDOx, SDIx and ~SSx as serial port pins
        //Interrupt when the last data in the receive buffer is read; as a result, the buffer is empty (SRXMPT bit is set)
        SPI1STAT = 0x8000;

        /* SPI2 for EEPROM */
        //same as configuration SPI1 module
        SPI2CON1 = 0b0000000100111110;
        SPI2STAT = 0x8000;
    #endif

    #ifdef USE_EXTERNAL_NVM
    	EEPROM_nCS	= 1;
    	EEPROM_nCS_TRIS	= 0;
    	IFS2bits.SPI2IF = 1;
    #endif

    PHY_RESETn = 0;
    PHY_RESETn_TRIS = 0;
    PHY_CS = 1;
    PHY_CS_TRIS = 0;

    RFIF = 0;
    RFIE = 1;

    if(RF_INT_PIN == 0)
    {
        RFIF = 1;
    }
    #if defined(USE_LED)
        WSAN_LED_TRIS = 0;
        WSAN_LED = CLEAR;//Clear Led to a initialize state
    #endif

}

/*********************************************************************
 * Function:        void SendOnceByte(BYTE data, WORD ClusterID)
 *
 * PreCondition:    Init OK
 *
 * Input:           data, CluaterID
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui trang thai ve router-EMB. Cac trang thai co the
 *                  la tat/bat bom, chay rung, canh bao muc nang luong.
 *
 * Note:
 ********************************************************************/

void SendOneByte(WORD ClusterID, BYTE MSB, BYTE LSB, BYTE cmd)
{
    TxBuffer[TxData++] = cmd;
    ZigBeeBlockTx();

